Revit 2017 API
Application.NewPlane Method (CurveArray)
 Creates a new geometric plane from a loop of planar curves.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2017. Please use CurveLoop.GetPlane() instead.")]
public Plane NewPlane(
	CurveArray curveloop
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2017. Please use CurveLoop.GetPlane() instead.")> _
Public Function NewPlane ( _
	curveloop As CurveArray _
) As Plane
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2017. Please use CurveLoop.GetPlane() instead.")]
public:
Plane^ NewPlane(
	CurveArray^ curveloop
)
Parameters
curveloop
Type: Autodesk.Revit.DB.CurveArray
 The closed loop of planar curves to locate plane.
Return Value
 If successful a new geometric plane will be returned. Otherwise null.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the input curve loop is null or empty.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the input curve loop does not lie in a plane.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the input curve loop is not closed.
See Also
Application Class
NewPlane Overload
Autodesk.Revit.Creation Namespace